bump_0p1/channel_scale_re1000/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   nonuniform List<scalar> 
4000
(
0.0245922
0.0737469
0.122804
0.171658
0.220104
0.267622
0.31511
0.364585
...
)
;

boundaryField
{
    movingWall
    {
        type            wall;
        value           nonuniform List<scalar> 
400
(
0.0249958
0.0249958
0.0249957
0.0249957
0.0249957
0.0249957
0.0249957
0.0249957
...
)
;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
