bump_0p1/channel_scale_re1000/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.01 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    in
    {
        type            cyclic;
    }

    out
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
	type 		cyclic;
    }
}

// ************************************************************************* //
