bump_0p1/channel_scale_re1000/0/gradTx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gradTx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   nonuniform List<scalar> 
4000
(
9.81554
9.80279
9.7728
9.71192
9.58102
9.49304
9.68955
10.1783
...
)
;

boundaryField
{
    movingWall
    {
        type            wall;
        value           nonuniform List<scalar> 
400
(
9.99772
9.99771
9.99769
9.99769
9.99769
9.99769
9.99768
9.99768
...
)
;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
