bump_0p1/channel_scale_re1000/0/gradTy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gradTy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   nonuniform List<scalar> 
4000
(
0.00226767
0.00744321
0.0151011
0.0296773
0.0659897
0.186956
0.351199
0.427095
...
)
;

boundaryField
{
    movingWall
    {
        type            wall;
        value           nonuniform List<scalar> 
400
(
0
0
0
0
0
0
0
0
...
)
;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
