bump_0p1/channel_scale_re1000/0/gradTz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gradTz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   nonuniform List<scalar> 
4000
(
-4.2587e-06
-1.1405e-05
-1.52266e-05
-1.15833e-05
-8.07352e-06
-1.13337e-05
-1.21602e-05
-4.6596e-06
...
)
;

boundaryField
{
    movingWall
    {
        type            wall;
        value           nonuniform List<scalar> 
400
(
-2.31707e-06
-1.08059e-05
-7.31169e-06
1.82762e-06
4.48623e-07
-1.0259e-06
-1.55448e-06
-7.76141e-08
...
)
;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
