bump_0p1/channel_scale_re1000/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4000
(
(0 1.41708e-16 -2.89152)
(0 -1.02747e-16 -2.89152)
(0 1.94806e-17 -2.89152)
(0 2.07529e-16 -2.89152)
(0 1.05042e-16 -2.89153)
(0 -7.83648e-17 -2.89426)
(0 6.50755e-16 -2.90406)
(0 -4.31791e-18 -2.92034)
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(0 1.1755e-16 2.89136)
(0 -1.1755e-16 2.89136)
(0 -1.1755e-16 2.89136)
(0 -1.1755e-16 2.89136)
(0 -1.1755e-16 2.89136)
(0 -1.1755e-16 2.89136)
(0 -1.1755e-16 2.89136)
(0 -1.1755e-16 2.89136)
...
)
;
    }
    in
    {
        type            cyclic;
    }
    out
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
