bump_0p1/channel_scale_re1000/system/FOLambVector
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

LambVector1
{
    // Mandatory entries
    type            LambVector;
    libs            ("libfieldFunctionObjects.so");

    // Optional (inherited) entries
    field           U;
//    result          LambVectorField;
//    region          region0;
//    enabled         true;
//    log             true;
//    timeStart       0.25;
//    timeEnd         1000;
//    executeControl  timeStep;
//    executeInterval 5;
//    writeControl    timeStep;
//    writeInterval   25;
}


// ************************************************************************* //
