bump_0p1/channel_scale_re1000/system/FOvorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

vorticity1
{
    // Mandatory entries
    type            vorticity;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    field           U;
    result          vorticityField;
//    region          region0;
//    enabled         true;
//    log             true;
//    timeStart       0.25;
//    timeEnd         1000;
//    executeControl  timeStep;
//    executeInterval 5;
    writeControl      writeTime;
//    writeInterval   25;
}


// ************************************************************************* //
