bump_0p1/channel_scale_re1000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.5)
    (1 0 0.5)
    (1 1 0.5)
    (0 1 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 25) simpleGrading (1 2 1)
);

edges
(
	 spline 0 1 ((0.0000   0.0000   0.0000)
   (0.0100   0.0000   0.0000)
   (0.0200   0.0000   0.0000)
   (0.0300   0.0000   0.0000)
   (0.0400   0.0000   0.0000)
   (0.0500   0.0000   0.0000)
   (0.0600   0.0000   0.0000)
   (0.0700   0.0000   0.0000)
   (0.0800   0.0000   0.0000)
   (0.0900   0.0000   0.0000)
   (0.1000   0.0000   0.0000)
   (0.1100   0.0000   0.0000)
   (0.1200   0.0000   0.0000)
   (0.1300   0.0000   0.0000)
   (0.1400   0.0000   0.0000)
   (0.1500   0.0000   0.0000)
   (0.1600   0.0000   0.0000)
   (0.1700   0.0000   0.0000)
   (0.1800   0.0000   0.0000)
   (0.1900   0.0000   0.0000)
   (0.2000   0.0000   0.0000)
   (0.2100   0.0000   0.0000)
   (0.2200   0.0000   0.0000)
   (0.2300   0.0000   0.0000)
   (0.2400   0.0000   0.0000)
   (0.2500   0.0000   0.0000)
   (0.2600   0.0004   0.0000)
   (0.2700   0.0016   0.0000)
   (0.2800   0.0035   0.0000)
   (0.2900   0.0062   0.0000)
   (0.3000   0.0095   0.0000)
   (0.3100   0.0136   0.0000)
   (0.3200   0.0181   0.0000)
   (0.3300   0.0232   0.0000)
   (0.3400   0.0287   0.0000)
   (0.3500   0.0345   0.0000)
   (0.3600   0.0406   0.0000)
   (0.3700   0.0469   0.0000)
   (0.3800   0.0531   0.0000)
   (0.3900   0.0594   0.0000)
   (0.4000   0.0655   0.0000)
   (0.4100   0.0713   0.0000)
   (0.4200   0.0768   0.0000)
   (0.4300   0.0819   0.0000)
   (0.4400   0.0864   0.0000)
   (0.4500   0.0905   0.0000)
   (0.4600   0.0938   0.0000)
   (0.4700   0.0965   0.0000)
   (0.4800   0.0984   0.0000)
   (0.4900   0.0996   0.0000)
   (0.5000   0.1000   0.0000)
   (0.5100   0.0996   0.0000)
   (0.5200   0.0984   0.0000)
   (0.5300   0.0965   0.0000)
   (0.5400   0.0938   0.0000)
   (0.5500   0.0905   0.0000)
   (0.5600   0.0864   0.0000)
   (0.5700   0.0819   0.0000)
   (0.5800   0.0768   0.0000)
   (0.5900   0.0713   0.0000)
   (0.6000   0.0655   0.0000)
   (0.6100   0.0594   0.0000)
   (0.6200   0.0531   0.0000)
   (0.6300   0.0469   0.0000)
   (0.6400   0.0406   0.0000)
   (0.6500   0.0345   0.0000)
   (0.6600   0.0287   0.0000)
   (0.6700   0.0232   0.0000)
   (0.6800   0.0181   0.0000)
   (0.6900   0.0136   0.0000)
   (0.7000   0.0095   0.0000)
   (0.7100   0.0062   0.0000)
   (0.7200   0.0035   0.0000)
   (0.7300   0.0016   0.0000)
   (0.7400   0.0004   0.0000)
   (0.7500   0.0000   0.0000)
   (0.7600   0.0000   0.0000)
   (0.7700   0.0000   0.0000)
   (0.7800   0.0000   0.0000)
   (0.7900   0.0000   0.0000)
   (0.8000   0.0000   0.0000)
   (0.8100   0.0000   0.0000)
   (0.8200   0.0000   0.0000)
   (0.8300   0.0000   0.0000)
   (0.8400   0.0000   0.0000)
   (0.8500   0.0000   0.0000)
   (0.8600   0.0000   0.0000)
   (0.8700   0.0000   0.0000)
   (0.8800   0.0000   0.0000)
   (0.8900   0.0000   0.0000)
   (0.9000   0.0000   0.0000)
   (0.9100   0.0000   0.0000)
   (0.9200   0.0000   0.0000)
   (0.9300   0.0000   0.0000)
   (0.9400   0.0000   0.0000)
   (0.9500   0.0000   0.0000)
   (0.9600   0.0000   0.0000)
   (0.9700   0.0000   0.0000)
   (0.9800   0.0000   0.0000)
   (0.9900   0.0000   0.0000)
   (1.0000   0.0000   0.0000))
	spline 4 5 ((0.0000   0.0000   0.5000)
   (0.0100   0.0000   0.5000)
   (0.0200   0.0000   0.5000)
   (0.0300   0.0000   0.5000)
   (0.0400   0.0000   0.5000)
   (0.0500   0.0000   0.5000)
   (0.0600   0.0000   0.5000)
   (0.0700   0.0000   0.5000)
   (0.0800   0.0000   0.5000)
   (0.0900   0.0000   0.5000)
   (0.1000   0.0000   0.5000)
   (0.1100   0.0000   0.5000)
   (0.1200   0.0000   0.5000)
   (0.1300   0.0000   0.5000)
   (0.1400   0.0000   0.5000)
   (0.1500   0.0000   0.5000)
   (0.1600   0.0000   0.5000)
   (0.1700   0.0000   0.5000)
   (0.1800   0.0000   0.5000)
   (0.1900   0.0000   0.5000)
   (0.2000   0.0000   0.5000)
   (0.2100   0.0000   0.5000)
   (0.2200   0.0000   0.5000)
   (0.2300   0.0000   0.5000)
   (0.2400   0.0000   0.5000)
   (0.2500   0.0000   0.5000)
   (0.2600   0.0004   0.5000)
   (0.2700   0.0016   0.5000)
   (0.2800   0.0035   0.5000)
   (0.2900   0.0062   0.5000)
   (0.3000   0.0095   0.5000)
   (0.3100   0.0136   0.5000)
   (0.3200   0.0181   0.5000)
   (0.3300   0.0232   0.5000)
   (0.3400   0.0287   0.5000)
   (0.3500   0.0345   0.5000)
   (0.3600   0.0406   0.5000)
   (0.3700   0.0469   0.5000)
   (0.3800   0.0531   0.5000)
   (0.3900   0.0594   0.5000)
   (0.4000   0.0655   0.5000)
   (0.4100   0.0713   0.5000)
   (0.4200   0.0768   0.5000)
   (0.4300   0.0819   0.5000)
   (0.4400   0.0864   0.5000)
   (0.4500   0.0905   0.5000)
   (0.4600   0.0938   0.5000)
   (0.4700   0.0965   0.5000)
   (0.4800   0.0984   0.5000)
   (0.4900   0.0996   0.5000)
   (0.5000   0.1000   0.5000)
   (0.5100   0.0996   0.5000)
   (0.5200   0.0984   0.5000)
   (0.5300   0.0965   0.5000)
   (0.5400   0.0938   0.5000)
   (0.5500   0.0905   0.5000)
   (0.5600   0.0864   0.5000)
   (0.5700   0.0819   0.5000)
   (0.5800   0.0768   0.5000)
   (0.5900   0.0713   0.5000)
   (0.6000   0.0655   0.5000)
   (0.6100   0.0594   0.5000)
   (0.6200   0.0531   0.5000)
   (0.6300   0.0469   0.5000)
   (0.6400   0.0406   0.5000)
   (0.6500   0.0345   0.5000)
   (0.6600   0.0287   0.5000)
   (0.6700   0.0232   0.5000)
   (0.6800   0.0181   0.5000)
   (0.6900   0.0136   0.5000)
   (0.7000   0.0095   0.5000)
   (0.7100   0.0062   0.5000)
   (0.7200   0.0035   0.5000)
   (0.7300   0.0016   0.5000)
   (0.7400   0.0004   0.5000)
   (0.7500   0.0000   0.5000)
   (0.7600   0.0000   0.5000)
   (0.7700   0.0000   0.5000)
   (0.7800   0.0000   0.5000)
   (0.7900   0.0000   0.5000)
   (0.8000   0.0000   0.5000)
   (0.8100   0.0000   0.5000)
   (0.8200   0.0000   0.5000)
   (0.8300   0.0000   0.5000)
   (0.8400   0.0000   0.5000)
   (0.8500   0.0000   0.5000)
   (0.8600   0.0000   0.5000)
   (0.8700   0.0000   0.5000)
   (0.8800   0.0000   0.5000)
   (0.8900   0.0000   0.5000)
   (0.9000   0.0000   0.5000)
   (0.9100   0.0000   0.5000)
   (0.9200   0.0000   0.5000)
   (0.9300   0.0000   0.5000)
   (0.9400   0.0000   0.5000)
   (0.9500   0.0000   0.5000)
   (0.9600   0.0000   0.5000)
   (0.9700   0.0000   0.5000)
   (0.9800   0.0000   0.5000)
   (0.9900   0.0000   0.5000)
   (1.0000   0.0000   0.5000))
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
	    (1 5 4 0)
        );
    }
    in
    {
        type 		cyclic;
	neighbourPatch	out; 
        faces
        (
            (0 4 7 3)
        );
    }
    out
    {
	type 		cyclic;
	neighbourPatch	in;
	faces 		(( 2 6 5 1));
    }
    front
    {
        type cyclic;
	neighbourPatch  back;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
	type cyclic;
	neighbourPatch  front;
	faces (( 4 5 6 7 ));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
