bump_0p1/channel_scale_re1000/system/blockMeshDict_1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.5)
    (1 0 0.5)
    (1 1 0.5)
    (0 1 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 25) simpleGrading (1 2 1)
);

edges
(
	 spline 0 1 ( (0 0 0)
	(0.0500000000000000	0	0)			
	(0.100000000000000	0	0)
	(0.150000000000000	0	0)
	(0.200000000000000	0	0)
	(0.250000000000000	0	0)
	(0.300000000000000	0.00190983005625053	0)	
	(0.350000000000000	0.00690983005625053	0)
	(0.400000000000000	0.0130901699437495	0)
	(0.450000000000000	0.0180901699437495	0)
	(0.500000000000000	0.0200000000000000	0)
	(0.550000000000000	0.0180901699437495	0)
	(0.600000000000000	0.0130901699437495	0)
	(0.650000000000000	0.00690983005625055	0)
	(0.700000000000000	0.00190983005625053	0)
	(0.750000000000000	0	0)	
	(0.800000000000000	0	0)
	(0.850000000000000	0	0)
	(0.900000000000000	0	0)
	(0.950000000000000	0	0)
	(1	0	0))

	spline 4 5 ( (0	0	0.500000000000000)	
	(0.0500000000000000	0	0.500000000000000)
	(0.100000000000000	0	0.500000000000000)
	(0.150000000000000	0	0.500000000000000)
	(0.200000000000000	0	0.500000000000000)
	(0.250000000000000	0	0.500000000000000)
	(0.300000000000000	0.00190983005625053	0.500000000000000)	
	(0.350000000000000	0.00690983005625053	0.500000000000000)
	(0.400000000000000	0.0130901699437495	0.500000000000000)
	(0.450000000000000	0.0180901699437495	0.500000000000000)
	(0.500000000000000	0.0200000000000000	0.500000000000000)
	(0.550000000000000	0.0180901699437495	0.500000000000000)
	(0.600000000000000	0.0130901699437495	0.500000000000000)
	(0.650000000000000	0.00690983005625055	0.500000000000000)
	(0.700000000000000	0.00190983005625053	0.500000000000000)
	(0.750000000000000	0	0.500000000000000)	
	(0.800000000000000	0	0.500000000000000)
	(0.850000000000000	0	0.500000000000000)
	(0.900000000000000	0	0.500000000000000)
	(0.950000000000000	0	0.500000000000000)
	(1	0	0.500000000000000))

	
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
	    (1 5 4 0)
        );
    }
    in
    {
        type 		cyclic;
	neighbourPatch	out; 
        faces
        (
            (0 4 7 3)
        );
    }
    out
    {
	type 		cyclic;
	neighbourPatch	in;
	faces 		(( 2 6 5 1));
    }
    front
    {
        type cyclic;
	neighbourPatch  back;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
	type cyclic;
	neighbourPatch  front;
	faces (( 4 5 6 7 ));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
