bump_0p1/channel_scale_re1000/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.004;

writeControl    timeStep;

writeInterval   25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
//	courantno
//	{
//	type CourantNo;
//	libs ("libfieldFunctionObjects.so");
//	writeControl    timeStep;
//    	writeInterval   10;
//	}


	vorticity1
{
    // Mandatory entries
    type            vorticity;
    libs           ("libfieldFunctionObjects.so");

    // Optional (inherited) entries
    field           U;
    result          om;
//    region          region0;
//    enabled         true;
//    log             true;
//    timeStart       0.25;
//    timeEnd         1000;
//    executeControl  timeStep;
//    executeInterval 5;
    writeControl      writeTime;
//    writeInterval   25;
}

    forces
    {
        type            forces;
        functionObjectLibs ("libforces.so");
        writeControl    writeTime;
        //writeInterval   1;
        patches         (movingWall); // Replace with your surface patches
        rho             rhoInf;          // For compressible cases; if not needed, can be commented out
        log             true;
        rhoInf          1.0;             // If rho is commented out, this can be removed
        CofR            (0 0 0);         // Center of rotation if needed, usually (0 0 0)
    }


}


// ************************************************************************* //
