bump_0p1/channel_scale_re1000/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
	{
        name    myCellZone; // Name of the cell set to create
        type    cellSet;
        action  new; // Can be new or add if you're adding to an existing set
        source  boxToCell; // Defining cells within a box region
        sourceInfo
        {
            box (0 0 0) (0.2 1 0.5); // Define the box coordinates
        }
    }
);

// ************************************************************************* //
